bit-finance/DataProcessors/бит_ОтложеннаяТрансляция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ОтложеннаяТрансляция</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийОбработкиОчередиТрансляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусыВыполненияОтложеннойТрансляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компоновщик</Name>
					<Comment>Компоновщик</Comment>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bit-finance/Enums/бит_СтатусыВыполненияОтложеннойТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_СтатусыВыполненияОтложеннойТрансляции</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
					<Comment>Ожидание</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
					<Comment>Выполнено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
					<Comment>Ошибка</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Enums/бит_ТипыСохраненныхНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыСохраненныхНастроек</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НастройкиПанелиИндикаторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчеты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/DataProcessors/бит_ОтложеннаяТрансляция/Forms/ОтложеннаяТрансляция/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновитьТекущийСписок", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КоличествоПоказываемыхСобытийПриИзменении(Элемент)
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		КоличествоПоказываемыхСобытий = ?(КоличествоПоказываемыхСобытий > 1000, 1000, КоличествоПоказываемыхСобытий);
	#КонецЕсли
	
	ОбновитьТекущийСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусБыстрыйОтборПриИзменении(Элемент)
	
	ОбработатьИзменениеСтатусБыстрыйОтбор();
	
	ОбновитьТекущийСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусБыстрыйОтборОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеОтбораНажатие(Элемент, СтандартнаяОбработка)
	
	ОткрытьНастройки();
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтложеннаяТрансляцияИспользованиеПриИзменении(Элемент)
	
	ТекущиеПараметрыРегламентногоЗадания = РежимОтложеннаяТрансляция();
	
	Изменения = Новый Структура("Расписание", ТекущиеПараметрыРегламентногоЗадания.Расписание);
	Изменения.Вставить("Использование", ОтложеннаяТрансляцияИспользование);

	Попытка
		УстановитьРежимОтложеннаяТрансляция(Изменения);		
	Исключение
		// Ошибка доступа.
	КонецПопытки;
	
	ОтложеннаяТрансляцияИспользование = Изменения.Использование;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаОчередиИспользованиеПриИзменении(Элемент)

	ТекущиеПараметрыРегламентногоЗадания = РежимОчисткаОчередиТрансляции();
	
	Изменения = Новый Структура("Расписание", ТекущиеПараметрыРегламентногоЗадания.Расписание);
	Изменения.Вставить("Использование", ОчисткаОчередиИспользование);

	Попытка
		УстановитьРежимУдалятьПоРасписанию(Изменения);		
	Исключение
		// Ошибка доступа.
	КонецПопытки;
	
	ОчисткаОчередиИспользование = Изменения.Использование;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалРегистрацииДатаНачалаПриИзменении(Элемент)
	
	ИнтервалДатРегистрацииПриИзменении();
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалРегистрацииДатаОкончанияПриИзменении(Элемент)
	
	ИнтервалДатРегистрацииПриИзменении();
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалСобытийДатаНачалаПриИзменении(Элемент)
	
	ИнтервалДатСобытийПриИзменении();
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалСобытийДатаОкончанияПриИзменении(Элемент)
	
	ИнтервалДатСобытийПриИзменении();
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОчередьТрансляции

&НаКлиенте
Процедура ОчередьТрансляцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	НачатьПросмотрТекущегоСобытияВОтдельномОкне();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчередьТрансляцииПриАктивизацииПоля(Элемент)

	ДоступенОтборПоЗначениюВТекущейКолонке =
		Элемент.ТекущийЭлемент <> Элементы.ОчередьТрансляцииПоставленоВОчередь
		И Элемент.ТекущийЭлемент <> Элементы.ОчередьТрансляцииДатаТрансляции;
	
	Элементы.УстановитьОтборПоЗначениюКонтекст.Доступность
		= ДоступенОтборПоЗначениюВТекущейКолонке;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчередьТрансляцииПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ОчередьТрансляции.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ДоступнаКомандаВыполнитьСейчас = 
		(ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.бит_СтатусыВыполненияОтложеннойТрансляции.Ожидание"));
		
	Элементы.КонтекстноеМенюВыполнитьСейчасКонтекст.Доступность = ДоступнаКомандаВыполнитьСейчас;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомпоновщикНастройкиОтбор

&НаКлиенте
Процедура КомпоновщикНастройкиОтборПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомпоновщикНастройкиПорядок

&НаКлиенте
Процедура КомпоновщикНастройкиПорядокПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтатусыОтбор
	
&НаКлиенте
Процедура СтатусыОтборПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	
	СтатусБыстрыйОтбор = ЗначениеСтатусБыстрыйОтбор(СтатусыОтбор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписок(Команда)
		
	ОбновитьТекущийСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрТекущегоСобытияВОтдельномОкне(Команда)
	
	НачатьПросмотрТекущегоСобытияВОтдельномОкне();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДанныеДляПросмотра(Команда)
	
	ТекущиеДанные = Элементы.ОчередьТрансляции.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено ИЛИ ТекущиеДанные.Объект = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Эта запись не связана с данными (см. колонку ""Документ"")'"));
		Возврат;
	КонецЕсли;
	
	Попытка
		ПоказатьЗначение(, ТекущиеДанные.Объект);
	Исключение
		ТекстПредупреждения = НСтр("ru = 'Эта запись связана с данными, но отобразить их невозможно'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьПериодРегистрации(Команда)
	
	Диалог 		  = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = ИнтервалДатРегистрации;
	Результат 	  = Ждать Диалог.РедактироватьАсинх();
	
	Если Результат <> Неопределено Тогда
		ИнтервалДатРегистрации			 = Результат;
		ИнтервалРегистрацииДатаНачала	 = ИнтервалДатРегистрации.ДатаНачала;
		ИнтервалРегистрацииДатаОкончания = ИнтервалДатРегистрации.ДатаОкончания;
		
		Если Элементы.РазделыОбработки.ТекущаяСтраница = Элементы.СтраницаОбработка Тогда
			ОбновитьТекущийСписок();
		Иначе	
			ИзмененыНастройки = Истина;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьПериодСобыйти(Команда)

	Диалог 		  = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = ИнтервалДатСобытий;
	Результат 	  = Ждать Диалог.РедактироватьАсинх();
	
	Если Результат <> Неопределено Тогда
		ИнтервалДатСобытий			 = Результат;
		ИнтервалСобытийДатаНачала	 = ИнтервалДатСобытий.ДатаНачала;
		ИнтервалСобытийДатаОкончания = ИнтервалДатСобытий.ДатаОкончания;
		
		Если Элементы.РазделыОбработки.ТекущаяСтраница = Элементы.СтраницаОбработка Тогда
			ОбновитьТекущийСписок();
		Иначе	
			ИзмененыНастройки = Истина;
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНастройки(Команда)

	ОткрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоЗначениюВТекущейКолонке(Команда)
	
	ТекущиеДанные = Элементы.ОчередьТрансляции.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПустьКДанным = СтрЗаменить(Элементы.ОчередьТрансляции.ТекущийЭлемент.Имя, "ОчередьТрансляции", "");
	Значение 	 = ТекущиеДанные[ПустьКДанным];
	
	Если Элементы.ОчередьТрансляции.ТекущийЭлемент = Элементы.ОчередьТрансляцииСтатус Тогда
		СтатусыОтбор.ЗаполнитьПометки(Ложь);
		СтатусБыстрыйОтбор = Значение;
		ОбработатьИзменениеСтатусБыстрыйОтбор();
	Иначе	
		бит_ОтчетыБФКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек.Настройки, 
			ПустьКДанным, Значение, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
		
	ОбновитьТекущийСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтбор(Команда)
	
	ИнтервалРегистрацииДатаНачала	 = '0001-01-01 00:00:00';
	ИнтервалРегистрацииДатаОкончания = '0001-01-01 00:00:00';
	ИнтервалСобытийДатаНачала 		 = '0001-01-01 00:00:00';
	ИнтервалСобытийДатаОкончания	 = '0001-01-01 00:00:00';
	
	ИнтервалДатРегистрацииПриИзменении();
	ИнтервалДатСобытийПриИзменении();
	
	СтатусБыстрыйОтбор = ПредопределенноеЗначение("Перечисление.бит_СтатусыВыполненияОтложеннойТрансляции.ПустаяСсылка");
	ОбработатьИзменениеСтатусБыстрыйОтбор();
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	
	ОбновитьТекущийСписок();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыполнитьСейчас(Команда)
	
	СтатусДляОперации = ПредопределенноеЗначение("Перечисление.бит_СтатусыВыполненияОтложеннойТрансляции.Ожидание");
	РезультатПоиска	  = РезультатПоискаВСписке(СтатусДляОперации);
	
	Если РезультатПоиска.ПомеченоСтрок = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Пометьте строки'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	ИначеЕсли РезультатПоиска.ПомеченоСтрок <> РезультатПоиска.ВыбраноСтрок Тогда	
		
		ТекстСообщения = НСтр("ru = 'Некоторые помеченные строки будут пропущены. 
                               |Только записи в статусе ""Ожидание"" могут быть источником данных для трансляции.
                               |Помечено: %1, отобрано: %2.
                               |Продолжить?'");
		
		ТекстСообщения = СтрШаблон(ТекстСообщения, Формат(РезультатПоиска.ПомеченоСтрок, "ЧН="), 
							Формат(РезультатПоиска.ВыбраноСтрок, "ЧН="));
							
		Результат = Ждать ВопросАсинх(ТекстСообщения, РежимДиалогаВопрос.ДаНет);					
		Если Результат <> КодВозвратаДиалога.Да Тогда
			Возврат;	
		КонецЕсли;		
	КонецЕсли;	

	Если РезультатПоиска.ВыбраноСтрок = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	НачатьОтложеннуюТрансляцию(РезультатПоиска.ДанныеДляОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСейчасКонтекст(Команда)
	
	ТекущиеДанные = Элементы.ОчередьТрансляции.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПомеченныеСтроки = Новый Массив;
	ПомеченныеСтроки.Добавить(ТекущиеДанные.ПолучитьИдентификатор());
	
	НачатьОтложеннуюТрансляцию(ПомеченныеСтроки);

КонецПроцедуры

&НаКлиенте
Асинх Процедура ИзменитьСтатус(Команда)
	
	НовыйСтатус = Ждать НовыйСтатус();
	Если НовыйСтатус = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПоиска = РезультатПоискаВСписке();
	
	Если РезультатПоиска.ПомеченоСтрок = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Пометьте строки'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;	

	НачатьОтложенноеИзменениеСтатуса(НовыйСтатус, РезультатПоиска.ДанныеДляОбработки);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ИзменитьСтатусКонтекст(Команда)
	
	ТекущиеДанные = Элементы.ОчередьТрансляции.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовыйСтатус = Ждать НовыйСтатус();
	Если НовыйСтатус = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПомеченныеСтроки = Новый Массив;
	ПомеченныеСтроки.Добавить(ТекущиеДанные.ПолучитьИдентификатор());
	
	НачатьОтложенноеИзменениеСтатуса(НовыйСтатус, ПомеченныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура УдалитьОбработанные(Команда)
		
	НачатьОтложеннуюОчисткуОчереди();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	УстановитьЗначениеПометкиВСпискеОчереди(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	УстановитьЗначениеПометкиВСпискеОчереди(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеОтложеннаяТрансляция(Команда)
	
	НачатьИзменениеРасписанияРегламентногоЗадания("ОтложеннаяТрансляция");
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеОчисткаОчереди(Команда)
	
	НачатьИзменениеРасписанияРегламентногоЗадания("ОчисткаОчереди");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНастройки(Команда)
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	Оповещение	   = Новый ОписаниеОповещения("ВыбратьНастройкиЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки", ПараметрыФормы, 
		ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры
	
// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте 
Процедура ВыбратьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда        
		ПрименитьНастройки(Результат);
		ОбновитьТекущийСписок();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)

	Если НЕ ПериодЗаполненПравильно() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	ПараметрыФормы.Вставить("СтруктураНастройки" , СохраняемыеНастройки());
	
	Оповещение = Новый ОписаниеОповещения("СохранитьНастройкиЗавершение",ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения", ПараметрыФормы, 
		ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
	
// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте
Процедура СохранитьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		УстановитьЗаголовок(Результат, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьНастройки(Команда)
	
	СкрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура СтандартныеНастройкиОтбора(Команда)

	СтандартныеНастройкиОтбораНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОтложенноеЗаполнениеСпискаОтложеннойТрансляции

&НаКлиенте
Процедура НачатьЗаполнениеСпискаОтложеннойТрансляции()

	Если НЕ ПериодЗаполненПравильно() Тогда
		Возврат;	
	КонецЕсли;
	
	СформироватьПредставлениеОтбора();
		
	Элементы.РазделыОбработки.ТекущаяСтраница = Элементы.СтраницаОжиданиеОбработки;
	Элементы.ДекорацияПоясняющийТекстДлительнойОперации.Заголовок = НСтр("ru = 'Идет заполнение списка документов'");
	
	ДлительнаяОперация = ЗапуститьОтложенноеЗаполнениеСпискаОтложеннойТрансляции();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗаполненияСпискаОтложеннойТрансляции", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ЗапуститьОтложенноеЗаполнениеСпискаОтложеннойТрансляции()
		
	НаименованиеЗадания = НСтр("ru = 'Заполнение списка отложенной трансляции.'");
	ВыполняемыйМетод	= "Обработки.бит_ОтложеннаяТрансляция.СписокОтложеннойТрансляции";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	Статусы.Очистить();
	Для каждого Запись Из СтатусыОтбор Цикл
		Если Запись.Пометка И  ЗначениеЗаполнено(Запись.Значение) Тогда
			Статусы.Добавить(Запись.Значение);	
		КонецЕсли;
	КонецЦикла;
	
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "ДатаНачалаРегистрации", ИнтервалДатРегистрации.ДатаНачала,
		ЗначениеЗаполнено(ИнтервалДатРегистрации.ДатаНачала));
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "ДатаОкончанияРегистраци", ИнтервалДатРегистрации.ДатаОкончания, 
		ЗначениеЗаполнено(ИнтервалДатРегистрации.ДатаОкончания));
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "ДатаНачалаОбработки", ИнтервалДатСобытий.ДатаНачала,
		ЗначениеЗаполнено(ИнтервалДатСобытий.ДатаНачала));
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "ДатаОкончанияОбработки", ИнтервалДатСобытий.ДатаОкончания, 
		ЗначениеЗаполнено(ИнтервалДатСобытий.ДатаОкончания));
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "Статусы",
		Статусы, ЗначениеЗаполнено(Статусы));
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "КоличествоПоказываемыхСобытий",
		КоличествоПоказываемыхСобытий);
		
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, 
						НастройкиКомпоновкиДанных);
						
	Возврат ФоновоеЗадание;

КонецФункции

// Обработка оповещения. Подробности см.ДлительныеОперацииКлиент.ОжидатьЗавершение.
//
&НаКлиенте
Процедура ПослеЗаполненияСпискаОтложеннойТрансляции(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Результат.Статус <> "Выполнено" Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении: %1'"); 
		ПоказатьПредупреждение(, СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	Иначе
		ПослеЗаполненияСпискаОтложеннойТрансляцииНаСервере(Результат.АдресРезультата);	
	КонецЕсли; 
	
	Элементы.РазделыОбработки.ТекущаяСтраница = Элементы.СтраницаОбработка;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаполненияСпискаОтложеннойТрансляцииНаСервере(АдресРезультата)

	ТаблицаДокументов = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	ОчередьТрансляции.Загрузить(ТаблицаДокументов);
			
КонецПроцедуры

#КонецОбласти

#Область ОтложенноеИзменениеСтуса

&НаКлиенте
Процедура НачатьОтложенноеИзменениеСтатуса(НовыйСтатус, ВыбранныеСтроки)

	Если ВыбранныеСтроки.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Пометьте строки'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Элементы.РазделыОбработки.ТекущаяСтраница = Элементы.СтраницаОжиданиеОбработки;
	Элементы.ДекорацияПоясняющийТекстДлительнойОперации.Заголовок = НСтр("ru = 'Идет изменение статусов записей очереди отложенной трансляции'");

	ДлительнаяОперация = ЗапуститьОтложенноеИзменениеСтатуса(НовыйСтатус, ВыбранныеСтроки);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеИзмененияСтатуса", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьОтложенноеИзменениеСтатуса(НовыйСтатус, ВыбранныеСтроки)

	НаименованиеЗадания = НСтр("ru = 'Изменение статусов записей очереди отложенной трансляции.'");
	ВыполняемыйМетод	= "Обработки.бит_ОтложеннаяТрансляция.ВыполнитьИзменениеСтатусаЗаписей";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	ПараметрыМетода = Обработки.бит_ОтложеннаяТрансляция.ПараметрыОтложеннойУстановкиСтатуса();
		
	Для каждого ВыбраннаяСтрока Из ВыбранныеСтроки Цикл
		СтрокаТаблицы = ОчередьТрансляции.НайтиПоИдентификатору(ВыбраннаяСтрока); 
		НоваяСтрока = ПараметрыМетода.ДокументыДляОбработки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы); 
		НоваяСтрока.НовыйСтатус = НовыйСтатус;
	КонецЦикла;
		
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, 
						ПараметрыМетода);
						
	Возврат ФоновоеЗадание;	

КонецФункции

// Обработка оповещения. Подробности см.ДлительныеОперацииКлиент.ОжидатьЗавершение.
//
&НаКлиенте
Процедура ПослеИзмененияСтатуса(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Результат.Статус <> "Выполнено" Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении: %1'"); 
		ПоказатьПредупреждение(, СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	Иначе
		ОбновитьТекущийСписок();	
	КонецЕсли; 	

	Элементы.РазделыОбработки.ТекущаяСтраница = Элементы.СтраницаОбработка;
	
КонецПроцедуры

#КонецОбласти

#Область ОтложеннаяТрансляция

&НаКлиенте
Процедура НачатьОтложеннуюТрансляцию(ВыбранныеСтроки)

	Элементы.РазделыОбработки.ТекущаяСтраница = Элементы.СтраницаОжиданиеОбработки;
	Элементы.ДекорацияПоясняющийТекстДлительнойОперации.Заголовок = НСтр("ru = 'Идет трансляция помеченных документов'");

	ДлительнаяОперация = ЗапуститьОтложеннуюТрансляцию(ВыбранныеСтроки);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыполненияОтложеннойТрансляции", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ЗапуститьОтложеннуюТрансляцию(ВыбранныеСтроки)

	НаименованиеЗадания = НСтр("ru = 'Отложенная трансляция'; en = 'Postponed Transformation'");
	ВыполняемыйМетод	= "Обработки.бит_ОтложеннаяТрансляция.НачатьОтложеннуюТрансляцию";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	ТаблицаФормы = РеквизитФормыВЗначение("ОчередьТрансляции");
	ДокументыДляОбработки = ТаблицаФормы.СкопироватьКолонки();
	
	Для каждого ВыбраннаяСтрока Из ВыбранныеСтроки Цикл
		СтрокаТаблицы = ОчередьТрансляции.НайтиПоИдентификатору(ВыбраннаяСтрока); 
		ЗаполнитьЗначенияСвойств(ДокументыДляОбработки.Добавить(), СтрокаТаблицы); 
	КонецЦикла;
			
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, 
						ДокументыДляОбработки);
						
	Возврат ФоновоеЗадание;		

КонецФункции

// Обработка оповещения. Подробности см.ДлительныеОперацииКлиент.ОжидатьЗавершение.
//
&НаКлиенте
Процедура ПослеВыполненияОтложеннойТрансляции(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Результат.Статус <> "Выполнено" Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении: %1'"); 
		ПоказатьПредупреждение(, СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	Иначе
		ОбновитьТекущийСписок();	
	КонецЕсли; 	
	
	Элементы.РазделыОбработки.ТекущаяСтраница = Элементы.СтраницаОбработка;
	
	Оповестить("ВыполненаОтложеннаяТрансляция",, ВладелецФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОтложеннаяОчисткаОчереди

&НаКлиенте
Процедура НачатьОтложеннуюОчисткуОчереди()

	Элементы.РазделыОбработки.ТекущаяСтраница = Элементы.СтраницаОжиданиеОбработки;
	Элементы.ДекорацияПоясняющийТекстДлительнойОперации.Заголовок = НСтр("ru = 'Идет очистка очереди отложенной трансляции'");

	ДлительнаяОперация = ЗапуститьОтложеннуюОчисткуОчереди();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыполненияОчисткиОчереди", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ЗапуститьОтложеннуюОчисткуОчереди()

	НаименованиеЗадания = НСтр("ru = 'Очистка очереди трансляции.'; en = 'Transformation Queue Cleanup'");
	ВыполняемыйМетод	= "Обработки.бит_ОтложеннаяТрансляция.НачатьОтложеннуюОчисткуОчереди";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
				
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод);
						
	Возврат ФоновоеЗадание;		

КонецФункции

// Обработка оповещения. Подробности см.ДлительныеОперацииКлиент.ОжидатьЗавершение.
//
&НаКлиенте
Процедура ПослеВыполненияОчисткиОчереди(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Результат.Статус <> "Выполнено" Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении: %1'"); 
		ПоказатьПредупреждение(, СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	Иначе
		ОбновитьТекущийСписок();	
	КонецЕсли; 	
	
	Элементы.РазделыОбработки.ТекущаяСтраница = Элементы.СтраницаОбработка;
	
КонецПроцедуры
	
#КонецОбласти

&НаКлиенте
Функция ПериодЗаполненПравильно()

	ЗаполненПравильно = Истина;
		
	ПутьКДанным = "";
	Если ИнтервалДатРегистрации.ДатаНачала > ИнтервалДатРегистрации.ДатаОкончания Тогда
		ТекстОшибки = НСтр("ru = 'Конец периода должен быть больше начала'; en = 'The end of the period must be greater than the beginning'");
		ПутьКДанным = "ИнтервалДатРегистрации.ДатаОкончания";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПутьКДанным) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, ПутьКДанным);
		ЗаполненПравильно = Ложь;
	КонецЕсли;
	
	ПутьКДанным = "";
	Если ИнтервалДатСобытий.ДатаНачала > ИнтервалДатСобытий.ДатаОкончания Тогда
		ТекстОшибки = НСтр("ru = 'Конец периода должен быть больше начала'; en = 'The end of the period must be greater than the beginning'");
		ПутьКДанным = "ИнтервалДатСобытий.ДатаОкончания";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПутьКДанным) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, ПутьКДанным);
		ЗаполненПравильно = Ложь;
	КонецЕсли;
	
	Возврат ЗаполненПравильно; 

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	
	Элементы.НастроитьРасписаниеОтложеннаяТрансляция.Доступность = Форма.ОтложеннаяТрансляцияИспользование;
	Элементы.НастроитьРасписаниеОчисткаОчереди.Доступность 		 = Форма.ОчисткаОчередиИспользование;

КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
		
	РежимРегламентногоЗадания 		  = РежимОтложеннаяТрансляция();
	ОтложеннаяТрансляцияИспользование = РежимРегламентногоЗадания.Использование;

	РежимРегламентногоЗадания 	= РежимОчисткаОчередиТрансляции();
	ОчисткаОчередиИспользование = РежимРегламентногоЗадания.Использование;
	
	Если ТипЗнч(Параметры.Отбор) = Тип("Структура") Тогда
		СтандартныеНастройкиОтбораНаСервере();
		Для каждого КлючЗначение Из Параметры.Отбор Цикл
			бит_ОтчетыБФКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек, КлючЗначение.Ключ, КлючЗначение.Значение);		
		КонецЦикла;
		ИнтервалДатРегистрации = Новый СтандартныйПериод;
		ИнтервалДатСобытий	   = Новый СтандартныйПериод;
		УстановитьЗаголовок(Неопределено, ЭтотОбъект);
	Иначе
		НастройкаПоУмолчанию = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта(НастраиваемыйОбъект());
		
		ПрименитьНастройки(НастройкаПоУмолчанию);
	КонецЕсли;
	
	Если ОбщегоНазначения.ЭтоВебКлиент() Или ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		УдаляемыйЭлемент = Элементы.КоличествоПоказываемыхСобытий.СписокВыбора.НайтиПоЗначению(10000);
		Элементы.КоличествоПоказываемыхСобытий.СписокВыбора.Удалить(УдаляемыйЭлемент);
		Элементы.КоличествоПоказываемыхСобытий.МаксимальноеЗначение = 1000;
		Если КоличествоПоказываемыхСобытий > 1000 Тогда
			КоличествоПоказываемыхСобытий = 1000;		
		КонецЕсли;
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекущийСписок()
	
	ИзмененыНастройки = Ложь;
	
	СкрытьНастройки();
	НачатьЗаполнениеСпискаОтложеннойТрансляции();
	
КонецПроцедуры

&НаСервере
Функция РежимОтложеннаяТрансляция()

	РежимРегламентногоЗадания = бит_МеханизмТрансляции.РежимОтложеннаяТрансляция();
	Возврат РежимРегламентногоЗадания;

КонецФункции

&НаСервере
Функция РежимОчисткаОчередиТрансляции()

	РежимРегламентногоЗадания = бит_МеханизмТрансляции.РежимОчисткаОчередиТрансляции();
	Возврат РежимРегламентногоЗадания;
	
КонецФункции

&НаКлиенте
Асинх Процедура НачатьИзменениеРасписанияРегламентногоЗадания(ИмяЗадания)
	
	Если ИмяЗадания = "ОтложеннаяТрансляция" Тогда
		СведенияОРегламентномЗадании = РежимОтложеннаяТрансляция();	
	ИначеЕсли ИмяЗадания = "ОчисткаОчереди"Тогда 
		СведенияОРегламентномЗадании = РежимОчисткаОчередиТрансляции();	
	Иначе	
		Возврат;
	КонецЕсли;
							
	Расписание = Новый РасписаниеРегламентногоЗадания;
	ЗаполнитьЗначенияСвойств(Расписание, СведенияОРегламентномЗадании.Расписание);

	Если НЕ СведенияОРегламентномЗадании.РазделениеВключено Тогда
		Диалог	   = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
		Расписание = Ждать Диалог.ОткрытьАсинх();
	КонецЕсли;
	
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;	

	Изменения = Новый Структура;
	Изменения.Вставить("Расписание", Расписание);
	Изменения.Вставить("Использование", Истина);

	Если ИмяЗадания = "ОтложеннаяТрансляция" Тогда
		ОтложеннаяТрансляцияИспользование = Истина;	
		УстановитьРежимОтложеннаяТрансляция(Изменения);
	ИначеЕсли ИмяЗадания = "ОчисткаОчереди" Тогда 
		ОчисткаОчередиИспользование = Истина;
		УстановитьРежимУдалятьПоРасписанию(Изменения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРежимОтложеннаяТрансляция(Изменения)

	бит_МеханизмТрансляции.УстановитьРежимОтложеннаяТрансляция(Изменения);	

КонецПроцедуры

&НаСервере
Процедура УстановитьРежимУдалятьПоРасписанию(Изменения)

	бит_МеханизмТрансляции.УстановитьРежимУдалятьПоРасписанию(Изменения);

КонецПроцедуры

&НаКлиенте
Процедура НачатьПросмотрТекущегоСобытияВОтдельномОкне()

	ТекущиеДанные = Элементы.ОчередьТрансляции.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;

	ПараметрыПередачи = Новый Структура;
	ПараметрыПередачи.Вставить("ДатаТрансляции");
	ПараметрыПередачи.Вставить("ПоставленоВОчередь");
	ПараметрыПередачи.Вставить("Объект");
	ПараметрыПередачи.Вставить("Источник");
	ПараметрыПередачи.Вставить("Приемник");
	ПараметрыПередачи.Вставить("Организация");
	ПараметрыПередачи.Вставить("Статус");
	ПараметрыПередачи.Вставить("Протокол");
	
	ЗаполнитьЗначенияСвойств(ПараметрыПередачи, ТекущиеДанные);

	ОткрытьФорму("Обработка.бит_ОтложеннаяТрансляция.Форма.Событие", ПараметрыПередачи, ЭтотОбъект, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыОтбораСобытийОчереди()

	ПараметрыПередачи = Новый Структура;
	ПараметрыПередачи.Вставить("ИнтервалДатРегистрации", ИнтервалДатРегистрации);
	ПараметрыПередачи.Вставить("ИнтервалДатСобытий", ИнтервалДатСобытий);
	ПараметрыПередачи.Вставить("НастройкиОтчета", КомпоновщикНастроек.ПолучитьНастройки());
	ПараметрыПередачи.Вставить("АдресСхемыКомпоновкиДанных", АдресСхемыКомпоновкиДанных);

	Возврат ПараметрыПередачи;
	
КонецФункции

&НаКлиенте
Процедура ИнтервалДатСобытийПриИзменении()

	ИнтервалДатСобытий.Вариант 		 = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ИнтервалДатСобытий.ДатаНачала	 = ИнтервалСобытийДатаНачала;
	ИнтервалДатСобытий.ДатаОкончания = ИнтервалСобытийДатаОкончания;

КонецПроцедуры

&НаКлиенте
Процедура ИнтервалДатРегистрацииПриИзменении()

	ИнтервалДатРегистрации.Вариант		 = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ИнтервалДатРегистрации.ДатаНачала 	 = ИнтервалРегистрацииДатаНачала;
	ИнтервалДатРегистрации.ДатаОкончания = ИнтервалРегистрацииДатаОкончания;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки()

	Элементы.РазделыОбработки.ТекущаяСтраница	  = Элементы.СтраницаНастройкиОбработки;
	Элементы.ПрименитьНастройки.КнопкаПоУмолчанию = Истина;	

КонецПроцедуры

&НаКлиенте
Функция ПараметрыХраненияНастроек()

	ПараметрыХранения = Новый Структура;
	ПараметрыХранения.Вставить("ТипНастройки",		  ПредопределенноеЗначение("Перечисление.бит_ТипыСохраненныхНастроек.Обработки"));
	ПараметрыХранения.Вставить("НастраиваемыйОбъект", НастраиваемыйОбъект());

	Возврат ПараметрыХранения;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НастраиваемыйОбъект()

	Возврат "Обработка.бит_ОтложеннаяТрансляция";

КонецФункции

&НаСервере
Процедура ПрименитьНастройки(НастройкаОтбораСобытий)
	
	Обработки.бит_ОтложеннаяТрансляция.ПрименитьНастройки(
		НастройкаОтбораСобытий, ЭтотОбъект);
			
	ИнтервалРегистрацииДатаНачала	 = ИнтервалДатРегистрации.ДатаНачала;
	ИнтервалРегистрацииДатаОкончания = ИнтервалДатРегистрации.ДатаОкончания;
	ИнтервалСобытийДатаНачала		 = ИнтервалДатСобытий.ДатаНачала;
	ИнтервалСобытийДатаОкончания 	 = ИнтервалДатСобытий.ДатаОкончания;
	
	СтатусыОтбор.Очистить();
	
	Для каждого Запись Из Элементы.СтатусБыстрыйОтбор.СписокВыбора Цикл
		Если ЗначениеЗаполнено(Запись.Значение) Тогда
			РезультатПоиска = Статусы.НайтиПоЗначению(Запись.Значение);
			СтатусыОтбор.Добавить(Запись.Значение, Запись.Представление, (РезультатПоиска <> Неопределено));		
		КонецЕсли;
	КонецЦикла;
	
	СтатусБыстрыйОтбор = ЗначениеСтатусБыстрыйОтбор(СтатусыОтбор);
	
	УстановитьЗаголовок(НастройкаОтбораСобытий, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовок(Настройка, Форма)
	
	Заголовок = НСтр("ru = 'Отложенная трансляция %1'; en = 'Delayed broadcast %1'");
	Если ЗначениеЗаполнено(Настройка) Тогда
		Заголовок = СтрШаблон(Заголовок, "(" + Строка(Настройка) + ")");
	Иначе	
		Заголовок = СтрШаблон(Заголовок, "");
	КонецЕсли;

	Форма.Заголовок = Заголовок;

КонецПроцедуры

// Функция создает структуру, хранящую настройки.
// 
// Возвращаемое значение:
//   СтруктураНастроек - Структура.
// 
&НаСервере
Функция СохраняемыеНастройки()
	
	СохраняемыеНастройки = Обработки.бит_ОтложеннаяТрансляция.НовыеСохраняемыеНастройки();
	ЗаполнитьЗначенияСвойств(СохраняемыеНастройки, ЭтотОбъект);
	
	СохраняемыеНастройки.НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	Возврат СохраняемыеНастройки;
	
КонецФункции

&НаКлиенте
Процедура СкрытьНастройки()

	Элементы.РазделыОбработки.ТекущаяСтраница 	  = Элементы.СтраницаОбработка;
	Элементы.ПрименитьНастройки.КнопкаПоУмолчанию = Ложь;

	Если ИзмененыНастройки Тогда
		ОбновитьТекущийСписок();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СтандартныеНастройкиОтбораНаСервере()

	Обработки.бит_ОтложеннаяТрансляция.ИнициализироватьКомпоновщик(КомпоновщикНастроек);	

КонецПроцедуры

&НаКлиенте
Процедура СформироватьПредставлениеОтбора()

	ПредставлениеОтбора = НСтр("ru = 'Не установлен'");
	
	ЧастиСтроки = Новый Массив;
	
	Если ЗначениеЗаполнено(ИнтервалРегистрацииДатаНачала) ИЛИ ЗначениеЗаполнено(ИнтервалРегистрацииДатаОкончания) Тогда
		ПериодРегистрации = НСтр("ru = 'Зарегистрировано'") + " "
						  + ПредставлениеПериода(ИнтервалРегистрацииДатаНачала, ИнтервалРегистрацииДатаОкончания); 
		ЧастиСтроки.Добавить(ПериодРегистрации);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнтервалСобытийДатаНачала) ИЛИ ЗначениеЗаполнено(ИнтервалСобытийДатаОкончания) Тогда
		ПериодРегистрации = НСтр("ru = 'Транслировано'") + " " 
						  + ПредставлениеПериода(ИнтервалСобытийДатаНачала, ИнтервалСобытийДатаОкончания); 
		ЧастиСтроки.Добавить(ПериодРегистрации);	
	КонецЕсли;
	
	Для каждого Запись Из СтатусыОтбор Цикл
		Если Запись.Пометка Тогда
			ЧастиСтроки.Добавить(Запись.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(КомпоновщикНастроек.Настройки.Отбор.Элементы) Тогда
		ЧастиСтроки.Добавить(Строка(КомпоновщикНастроек.Настройки.Отбор));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЧастиСтроки) Тогда
		ПредставлениеОтбора = СтрСоединить(ЧастиСтроки, ", ");
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеСтатусБыстрыйОтбор(Знач СтатусыОтбор)
	
	Помеченные = Новый Массив;
	Для каждого Запись Из СтатусыОтбор Цикл
		Если Запись.Пометка Тогда
			Помеченные.Добавить(Запись.Значение);		
		КонецЕсли;	
	КонецЦикла;
	
	СтатусБыстрыйОтбор = Неопределено;
	Если Помеченные.Количество() = 0 Тогда
		СтатусБыстрыйОтбор = ПредопределенноеЗначение("Перечисление.бит_СтатусыВыполненияОтложеннойТрансляции.ПустаяСсылка");
	ИначеЕсли Помеченные.Количество() = 1 Тогда	
		СтатусБыстрыйОтбор = Помеченные[0];
	КонецЕсли;

	Возврат СтатусБыстрыйОтбор;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьИзменениеСтатусБыстрыйОтбор()

	Для каждого Запись Из СтатусыОтбор Цикл
		Запись.Пометка = (Запись.Значение = СтатусБыстрыйОтбор);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеПометкиВСпискеОчереди(ЗначениеФлага)

	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(ОчередьТрансляции, 
		"Пометка", ЗначениеФлага, Элементы.ОчередьТрансляции);

КонецПроцедуры

&НаКлиенте
Функция РезультатПоискаВСписке(СтатусДляОперации = Неопределено)
	
	// Для исключения перехода на сервер выполняем сканирование списка.
	
	ПомеченоСтрок = 0;
	ВыбраноСтрок  = 0;
	
	ДанныеДляОбработки = Новый Массив;
	Для каждого СтрокаТаблицы Из ОчередьТрансляции Цикл
		Если НЕ СтрокаТаблицы.Пометка Тогда
			Продолжить;
		КонецЕсли;	
		
		ПомеченоСтрок = ПомеченоСтрок + 1;
		
		Если ЗначениеЗаполнено(СтатусДляОперации) И СтрокаТаблицы.Статус <> СтатусДляОперации Тогда
			Продолжить;	
		КонецЕсли;
		ВыбраноСтрок = ВыбраноСтрок + 1;
		
		ДанныеДляОбработки.Добавить(СтрокаТаблицы.ПолучитьИдентификатор());	
	КонецЦикла;
	
	РезультатПоиска = Новый Структура;
	РезультатПоиска.Вставить("ПомеченоСтрок", 	   ПомеченоСтрок);
	РезультатПоиска.Вставить("ВыбраноСтрок", 	   ВыбраноСтрок);
	РезультатПоиска.Вставить("ДанныеДляОбработки", ДанныеДляОбработки);
	
	Возврат РезультатПоиска;
	
КонецФункции

&НаКлиенте
Асинх Функция НовыйСтатус()

	ТекстВопроса = НСтр("ru = 'Как изменить статус выбранных записей?'");
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(ПредопределенноеЗначение("Перечисление.бит_СтатусыВыполненияОтложеннойТрансляции.Ожидание"), НСтр("ru = 'Поставить в очередь'"));
	Кнопки.Добавить(ПредопределенноеЗначение("Перечисление.бит_СтатусыВыполненияОтложеннойТрансляции.Выполнено"), НСтр("ru = 'Отметить выполнение'"));
	Кнопки.Добавить(ПредопределенноеЗначение("Перечисление.бит_СтатусыВыполненияОтложеннойТрансляции.Ошибка"), НСтр("ru = 'Считать ошибкой'"));
	Кнопки.Добавить(Неопределено, НСтр("ru = 'Отмена'"));
	
	НовыйСтатус = Ждать ВопросАсинх(ТекстВопроса, Кнопки);
	
	Возврат НовыйСтатус;

КонецФункции

#КонецОбласти
